; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite3 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	image4 - mode
	image1 - mode
	thermograph3 - mode
	thermograph2 - mode
	thermograph0 - mode
	GroundStation3 - direction
	Star0 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(supports instrument1 image4)
	(calibration_target instrument1 Star0)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(supports instrument3 image4)
	(calibration_target instrument3 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument4 thermograph2)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 thermograph3)
	(supports instrument5 image4)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument6 image4)
	(supports instrument6 thermograph3)
	(calibration_target instrument6 Star4)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 Star0)
	(supports instrument8 thermograph3)
	(supports instrument8 image4)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star0)
	(supports instrument9 thermograph2)
	(supports instrument9 image4)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(on_board instrument9 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument10 image4)
	(supports instrument10 image1)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 Star4)
	(supports instrument11 image4)
	(supports instrument11 image1)
	(calibration_target instrument11 GroundStation1)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 GroundStation2)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
)
(:goal (and
	(pointing satellite1 Star9)
	(pointing satellite2 Planet8)
	(pointing satellite3 Phenomenon11)
	(have_image Phenomenon5 thermograph3)
	(have_image Phenomenon6 image1)
	(have_image Planet7 image1)
	(have_image Planet8 thermograph2)
	(have_image Star9 thermograph0)
	(have_image Planet10 image1)
	(have_image Phenomenon11 thermograph2)
))

)

; plan
1. (turn_to satellite3 phenomenon11 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 phenomenon11)
   goals met: 1 of 10
2. (turn_to satellite2 star0 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star0)
   goals met: 1 of 10
3. (switch_on instrument8 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument8)
   goals met: 1 of 10
4. (calibrate satellite2 instrument8 star0)
   added: (calibrated instrument8)
   goals met: 1 of 10
5. (turn_to satellite2 phenomenon5 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon5)
   goals met: 1 of 10
6. (take_image satellite2 phenomenon5 instrument8 thermograph3)
   added: (have_image phenomenon5 thermograph3)
   goals met: 2 of 10
7. (turn_to satellite2 phenomenon11 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 10
8. (turn_to satellite1 star9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star9)
   goals met: 3 of 10
9. (turn_to satellite0 star4 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star4)
   goals met: 3 of 10
10. (take_image satellite2 phenomenon11 instrument8 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 4 of 10
11. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 4 of 10
12. (calibrate satellite0 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 4 of 10
13. (turn_to satellite0 phenomenon6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 10
14. (take_image satellite0 phenomenon6 instrument2 image1)
   added: (have_image phenomenon6 image1)
   goals met: 5 of 10
15. (turn_to satellite0 planet10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet10)
   goals met: 5 of 10
16. (take_image satellite0 planet10 instrument2 image1)
   added: (have_image planet10 image1)
   goals met: 6 of 10
17. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   goals met: 6 of 10
18. (take_image satellite0 planet7 instrument2 image1)
   added: (have_image planet7 image1)
   goals met: 7 of 10
19. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 7 of 10
20. (take_image satellite0 star9 instrument2 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 8 of 10
21. (turn_to satellite2 planet8 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet8)
   goals met: 9 of 10
22. (take_image satellite2 planet8 instrument8 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 10 of 10
